// src/pages/AboutMe.jsx
function AboutMe() {
    return (
        <div>
            <h1>Про мене</h1>
            <p>Привіт! Мене звуть ОЛЕГ, я фронтенд-розробник з початківим  досвідом у створенні веб-додатків.</p>
            <p>Мій шлях в ІТ почався з захоплення програмуванням, і тепер я спеціалізуюсь на розробці сучасних веб-додатків за допомогою React, JavaScript, HTML, CSS та інших технологій.</p>
            <p>Мої навички включають:</p>
            <ul>
                <li> Я навчаюся курсі Front-end Pro </li>
                <li>Побудова масштабованих і продуктивних веб-додатків</li>
                <li>Оптимізація веб-сторінок для швидкості та зручності користувачів</li>
                <li>Інтеграція з різними API та бекенд-сервісами</li>
            </ul>
            <p>Я завжди шукаю нові цікаві проекти та готовий до співпраці!</p>
        </div>
    );
}

export default AboutMe;
