import { Footer, Header, PageLayout } from '@components';
import { Box, Typography } from '@mui/material';

export function About() {
  return (
    <PageLayout
      renderHeader={() => <Header />}
      renderContent={() => (
        <Box>
          <Typography variant="h1">About</Typography>
          <Typography paragraph>
            Санаторії Трускавця відомі кожній людині як синонім якісного лікування. Трускавець — курортна столиця України. Вже майже два сторіччя курорт приймає відвідувачів на лікування та відпочинок. Розташований в мальовничому куточку східних Карпат він приваблює безцінними природними ресурсами та розвинутим сервісом. Всесвітній відомості курорт завдячує своїм мінеральним водам. ”Нафтуся” найвідоміша з них. Саме трускавецька “Нафтуся” має унікально збалансований склад органічних речовин нафтового походження. Вона сприяє лікуванню захворювань нирок, жовчного міхура, печінки та виведенню каміння. Мінеральні води Трускавця ефективні при порушенні обміну речовин, захворюваннях шлунку, опорно-рухового апарату.
            Окрім “Нафтусі” санаторії Трускавця славляться іншими джерелами. Так джерело №4 “Юзя” відоме своїм “омолоджувальним” ефектом. Завдяки вмісту гліцерину цілюще впливає на стан шкіри. Вода з джерела № 3 “Броніслава” застосовується для полоскання носогорла при захворюваннях дихальних шляхів. З інших джерел беруть воду для лікувальних ванн. Знамениту сіль “Барбара” виготовляють з ропи однойменного джерела. Вона є аналогом “Карловарської солі”.
            На жаль свої лікувальні властивості вода зберігає впродовж короткого терміну. Для досягнення терапевтичного ефекту її вживають безпосередньо з джерел.
            На що звернути увагу обираючи санаторії Трускавця.
            Відпочинок на водах в Трускавці набув великої популярності ще за часів Австро-Угорщині. Сьогодні це сучасне місто-курорт європейського рівня. Великий вибір готелів, пансіонатів, санаторіїв, житло в приватному секторі задовольнить всіх охочих. Ціни на відпочинок залежать від вибору місця проживання та комплексу лікувальних процедур.
          </Typography>
        </Box>
      )}
      renderFooter={() => <Footer />}
    />
  );
}
